'''Написати функцію, яка приймає два параметри: ім'я (шлях) файлу та кількість символів. 
Файл також додайте в репозиторій. На екран має бути виведений список із трьома блоками - 
символи з початку, із середини та з кінця файлу. Кількість символів в блоках - та, яка 
введена в другому параметрі. Придумайте самі, як обробляти помилку, наприклад, коли 
кількість символів більша, ніж є в файлі або, наприклад, файл із двох символів і 
треба вивести по одному символу, то що виводити на місці середнього блоку символів?). 
Не забудьте додати перевірку чи файл існує.'''

def text_slice(name, lenght):
	try:
		with open(name, 'rt') as file:
			text = file.read()

		if len(text) < lenght :
			print(f"Діапазон блоку перевищує кількість символів у файлі. Всього: {len(text)}.")
			print(f"Змініть діапазон та повторіть спробу.")
			return None
		elif lenght <= 0:
			print("Кількість символів не може бути від'ємною!")
			return None
		bloks = []
		
		bloks.append(text[0:lenght])
		bloks.append(text[int(len(text)/2-lenght/2):int(len(text)/2+lenght/2)])
		bloks.append(text[len(text)-lenght:])

		if (len(text) % 2 == 0 and lenght % 2 == 1) or (len(text) % 2 == 1 and lenght % 2 == 0):
			print('')
			print("Не правильно вказано значення діапазону, неможливо отримати середній елемент.")
			print(f"Символів у файлі : {len(text)}")
			print("Ви отримали середній елемент зі зміщенням ліворуч.")

		return bloks
	except TypeError:
		print("Не правильно вказані дані. Кількість символів - це натуральне число.")
	except FileNotFoundError:
		print("Не правильно вказане ім'я файлу!")
		
	


#print(text_slice('text_1.txt', 3))

