'''Написати функцію, яка приймає два параметри: ім'я (шлях) файлу та кількість символів. 
Файл також додайте в репозиторій. На екран має бути виведений список із трьома блоками - 
символи з початку, із середини та з кінця файлу. Кількість символів в блоках - та, яка 
введена в другому параметрі. Придумайте самі, як обробляти помилку, наприклад, коли 
кількість символів більша, ніж є в файлі або, наприклад, файл із двох символів і 
треба вивести по одному символу, то що виводити на місці середнього блоку символів?). 
Не забудьте додати перевірку чи файл існує.'''

def text_slice(name, lenght):
	with open(name, 'rt') as file:
		text = file.read()

	if len(text) < lenght:
		print(f"Діапазон блоку перевищує кількість символів у файлі. Всього: {len(text)}.")
		print(f"Змініть діапазон та повторіть спробу.")
		return None
	bloks = []
	if len(text) % 2 == lenght % 2 :
		bloks.append(text[0:lenght])
		bloks.append(text[int(len(text)/2-lenght/2):int(len(text)/2+lenght/2)])
		bloks.append(text[len(text)-lenght:])
		return bloks
	else :
		print("Не правильно вказано значення діапазону, неможливо отримати середній елемент.")
		print(f"Символів у файлі : {len(text)}")
		print("Введіть діапазон тієї ж парності!")
		return None
	


print(text_slice('text_1.txt', 3))

