'''Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді коду Морзе
 та виводить декодоване значення (латинськими літерами).
   Особливості:
    - використовуються лише крапки, тире і пробіли (.- )
    - один пробіл означає нову літеру
    - три пробіли означають нове слово
    - результат може бути case-insensitive (на ваш розсуд - великими чи маленькими літерами).
    - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки тощо 
    використовуватися не будуть. Лише латинські літери.
    - додайте можливість декодування сервісного сигналу SOS (...---...)
    Приклад:
    --. . . -.- .... ..- -...   .. ...   .... . .-. .
    результат: GEEKHUB IS HERE'''

def morse_code(morse_str: str):
	DEF_MORSE_CODE_DICT = {
    'A': '.-',
    'B': '-...',
    'C': '-.-.',
    'D': '-..',
    'E': '.',
    'F': '..-.',
    'G': '--.',
    'H': '....',
    'I': '..',
    'J': '.---',
    'K': '-.-',
    'L': '.-..',
    'M': '--',
    'N': '-.',
    'O': '---',
    'P': '.--.',
    'Q': '--.-',
    'R': '.-.',
    'S': '...',
    'T': '-',
    'U': '..-',
    'V': '...-',
    'W': '.--',
    'X': '-..-',
    'Y': '-.--',
    'Z': '--..',
    'SOS': '...---...',
    }

	decod_str = ''
	morse_words = morse_str.split('   ')
	for word in morse_words:
		morse_letters = word.split(' ')
		for letter in morse_letters:
			for key, value in DEF_MORSE_CODE_DICT.items():
				if letter == value:
					decod_str += key
		decod_str += ' '
	return decod_str

#print(morse_code('--. . . -.- .... ..- -...   .. ...   .... . .-. .'))
#print(morse_code('...---...'))