'''Написати функцію <bank> , яка працює за наступною логікою: користувач робить вклад 
у розмірі <a> одиниць строком на <years> років під <percents> відсотків (кожен рік 
сума вкладу збільшується на цей відсоток, ці гроші додаються до суми вкладу і в 
наступному році на них також нараховуються відсотки). Параметр <percents> є 
необов'язковим і має значення по замовчуванню <10> (10%). Функція повинна 
принтануть суму, яка буде на рахунку, а також її повернути (але округлену до копійок).'''

def bank(a, years, percents = 10):
	result = round(a * (1 + percents/100) ** years, 2)
	print(f'Ви отримаєте на рахунку {result}, через {years} років, під {percents}% річних, при вкладі {a}.')
	return result

#print(bank(30000, 10))