'''Написати функцiю season, яка приймає один аргумент 
(номер мiсяця вiд 1 до 12) та яка буде повертати пору 
року, до якої цей мiсяць належить (зима, весна, лiто 
або осiнь). У випадку некоректного введеного 
значення - виводити відповідне повідомлення.'''

#month_number = int(input("Введіть номер мiсяця: \n"))


def season(month_number):
	if month_number in (1, 2, 12):
		return "Зима"
	if month_number in (3, 4, 5):
		return "Весна"
	if month_number in (6, 7, 8):
		return "Літо"
	if month_number in (9, 10, 11):
		return "Осінь"
	else:
		print("Необхідно ввести натуральне число від 1 до 12, що відповідає номеру місяця")
		return "Не правильно вказаний номер місяця"


#print(season(month_number))